УТ_для_edt.ДоставкаДеловыеЛинии/src/Catalogs/ДЛ_Терминалы/ДЛ_Терминалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДЛ_Терминалы</name>
  <attributes>
    <name>ИДтерминала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.ДЛ_Города</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолныйАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>600</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Широта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Долгота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоОфис</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Приемка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Выдача</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Хранение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаНаложенымПлатежом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодУлицы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикПоПриему</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикПоВыдаче</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяДлина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяШирина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяВысота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РежимРаботыОтделов</name>
    <attributes>
      <name>Отдел</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РежимРаботы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.ДоставкаДеловыеЛинии/src/Catalogs/ДЛ_Терминалы/ManagerModule.bsl
Функция ПолучитьМассивПоляПоиска() Экспорт	
	
	Возврат ДЛ_ДеловыеЛинии.МассивДвухЭлементов("id", "ИДтерминала");
	
КонецФункции    

Функция ПолучитьТаблицуПолейЗначений() Экспорт
	
	Результат = ДЛ_ДеловыеЛинии.НоваяТаблицаПолейЗначений();
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "name", "Наименование", "Реквизит");	 
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "address", "Адрес", "Реквизит");	 
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "fullAddress", "ПолныйАдрес", "Реквизит");	 
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "latitude", "Широта", "Реквизит");
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "longitude", "Долгота", "Реквизит");	 
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "isOffice", "ТолькоОфис", "Реквизит");	 
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "receiveCargo", "Приемка", "Реквизит");	 
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "giveoutCargo", "Выдача", "Реквизит");	 
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "storage", "Хранение", "Реквизит");	 
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "cashOnDelivery", "ОплатаНаложенымПлатежом", "Реквизит");	 
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "addressCode", "", "ВложенныеРеквизиты", Новый Структура("street_code", "КодУлицы"));	 
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "calcSchedule", "", "ВложенныеРеквизиты", Новый Структура("arrival, derival", "ГрафикПоВыдаче", "ГрафикПоПриему"));
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "default", "ПоУмолчанию", "Реквизит");
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "maxVolume", "МаксимальныйОбъем", "Реквизит");
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "maxWeight", "МаксимальныйВес", "Реквизит");
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "maxHeight", "МаксимальнаяВысота", "Реквизит"); 
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "maxWidth", "МаксимальнаяШирина", "Реквизит");
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "maxLength", "МаксимальнаяДлина", "Реквизит");   	
	
	МассивРежимРаботы = Новый Массив;
	МассивРежимРаботы.Добавить("ТабличнаяЧасть");
	МассивРежимРаботы.Добавить("РежимРаботыОтделов");
	МассивРежимРаботы.Добавить(Новый Структура("Отдел, РежимРаботы", "department", "timetable"));	
	
	ДЛ_ДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "worktables", "", "ВложенныеРеквизиты", Новый Структура("worktable", МассивРежимРаботы));
		
	Возврат Результат;
	
КонецФункции
